title: Shadow Credentials - msDS-KeyCredentialLink Modification
id: d395471b-5cae-4bc5-8fdc-771522c26736
description: Detects abuse of msDS-KeyCredentialLink for shadow credential persistence (coercion/relay via AD CS)
status: stable
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    ObjectType|contains: "msDS-KeyCredentialLink"
  condition: selection
fields:
  - SubjectUserName
  - ObjectName
falsepositives:
  - Legitimate Azure AD Hybrid Key provisioning
level: critical
tags:
  - attack.persistence
  - attack.t1098
